Broadcom/AFBR-S50-API/Sources/Platform/STM32F4xx/device/core/Cortex-M4.svd
        <register>
          <name>CPACR</name>
          <displayName>CPACR</displayName>
          <description>CPACR</description>
          <addressOffset>0xD80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CP11</name>
              <description>CP11</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Access_denied</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Privileged_mode_access_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Full_access</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP10</name>
              <description>CP10</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Access_denied</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Privileged_mode_access_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Full_access</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP7</name>
              <description>CP7</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Access_denied</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Privileged_mode_access_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Full_access</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP6</name>
              <description>CP6</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Access_denied</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Privileged_mode_access_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Full_access</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP5</name>
              <description>CP5</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Access_denied</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Privileged_mode_access_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Full_access</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP4</name>
              <description>CP4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Access_denied</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Privileged_mode_access_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Full_access</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP3</name>
              <description>CP3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Access_denied</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Privileged_mode_access_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Full_access</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP2</name>
              <description>CP2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Access_denied</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Privileged_mode_access_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Full_access</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP1</name>
              <description>CP1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Access_denied</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Privileged_mode_access_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Full_access</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP0</name>
              <description>CP0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Access_denied</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Privileged_mode_access_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Full_access</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STIR</name>
          <displayName>STIR</displayName>
          <description>STIR</description>
          <addressOffset>0xEF8</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>INTID</name>
              <description>INTID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
